DataStructuresAndC/bitmanipulation.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' href='https://cdn.simplecss.org/simple.min.css' />
   <link rel='stylesheet' type='text/css' href='../css/tech-notes-site.css' />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../"> HOME </a>
</div><nil id="nil" class="content">
<section id="outline-container-org2fcf6c5" class="outline-2">
<h2 id="org2fcf6c5">Check if number is power of 2</h2>
<div class="outline-text-2" id="text-org2fcf6c5">
<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">def</span> <span class="org-function-name">check_pow_2</span>(num: <span class="org-builtin">int</span>) <span class="org-operator">-&gt;</span> <span class="org-builtin">int</span>:
    <span class="org-keyword">if</span> num <span class="org-operator">==</span> 0:
        <span class="org-keyword">return</span> 0

    <span class="org-keyword">if</span> num <span class="org-operator">&amp;</span> (num <span class="org-operator">-</span> 1):
        <span class="org-keyword">return</span> 1;

    <span class="org-keyword">return</span> <span class="org-operator">-</span>1;

<span class="org-variable-name">switch</span> <span class="org-operator">=</span> {
    0: <span class="org-string">"number is 0"</span>,
    1: <span class="org-string">"number is power of 2"</span>,
    <span class="org-operator">-</span>1: <span class="org-string">"number is not power of 2 nor 0"</span>
}

<span class="org-keyword">case</span> <span class="org-operator">=</span> check_pow_2(7)
<span class="org-builtin">print</span>(switch[<span class="org-keyword">case</span>])
</pre>
</div>


<div class="org-src-container">
<pre class="src src-python">

<span class="org-keyword">import</span> time

<span class="org-keyword">def</span> <span class="org-function-name">count_bits_tobe_flipped</span>(a: <span class="org-builtin">int</span>, b: <span class="org-builtin">int</span>) <span class="org-operator">-&gt;</span> <span class="org-builtin">int</span>:
    <span class="org-variable-name">x</span> <span class="org-operator">=</span> a <span class="org-operator">^</span> b
    <span class="org-variable-name">counter</span> <span class="org-operator">=</span> 0
    <span class="org-keyword">while</span> x <span class="org-operator">!=</span> 0:        
        <span class="org-keyword">if</span> x <span class="org-operator">&amp;</span> 1:
            <span class="org-variable-name">counter</span> <span class="org-operator">+=</span> 1        
        <span class="org-variable-name">x</span> <span class="org-operator">&gt;&gt;=</span> 1

    <span class="org-keyword">return</span> counter


<span class="org-comment-delimiter"># </span><span class="org-comment">get the start time
</span><span class="org-variable-name">st</span> <span class="org-operator">=</span> time.time()

<span class="org-builtin">print</span>(count_bits_tobe_flipped(63, 20))

<span class="org-comment-delimiter"># </span><span class="org-comment">get the end time
</span><span class="org-variable-name">et</span> <span class="org-operator">=</span> time.time()

<span class="org-comment-delimiter"># </span><span class="org-comment">get the execution time
</span><span class="org-variable-name">elapsed_time</span> <span class="org-operator">=</span> (et <span class="org-operator">-</span> st) <span class="org-operator">*</span> 1000
<span class="org-builtin">print</span>(<span class="org-string">'Execution time:'</span>, elapsed_time, <span class="org-string">'milliseconds'</span>)




<span class="org-keyword">def</span> <span class="org-function-name">count_bits_flip</span>(a, b):
    <span class="org-comment-delimiter"># </span><span class="org-comment">XOR a and b to get 1 on opposite value bit position
</span>    <span class="org-variable-name">c</span> <span class="org-operator">=</span> a <span class="org-operator">^</span> b

    <span class="org-comment-delimiter"># </span><span class="org-comment">initialise the counter for 1
</span>    <span class="org-variable-name">count</span> <span class="org-operator">=</span> 0
    <span class="org-comment-delimiter"># </span><span class="org-comment">count the number of 1s while there is 1 in a ^ b
</span>    <span class="org-keyword">while</span> c <span class="org-operator">!=</span> 0:
        <span class="org-variable-name">count</span> <span class="org-operator">+=</span> 1
        <span class="org-variable-name">c</span> <span class="org-operator">&amp;=</span> (c<span class="org-operator">-</span>1)

    <span class="org-comment-delimiter"># </span><span class="org-comment">return the count of 1s
</span>    <span class="org-keyword">return</span> count


<span class="org-comment-delimiter"># </span><span class="org-comment">get the start time
</span><span class="org-variable-name">st</span> <span class="org-operator">=</span> time.time()

<span class="org-builtin">print</span>(count_bits_flip(63, 20))

<span class="org-comment-delimiter"># </span><span class="org-comment">get the end time
</span><span class="org-variable-name">et</span> <span class="org-operator">=</span> time.time()
<span class="org-variable-name">elapsed_time</span> <span class="org-operator">=</span> (et <span class="org-operator">-</span> st) <span class="org-operator">*</span> 1000
<span class="org-builtin">print</span>(<span class="org-string">'Execution time:'</span>, elapsed_time, <span class="org-string">'milliseconds'</span>)
</pre>
</div>
</div>
</section>
</nil>
<footer id="postamble" class="status">

<div class='footer'>
Copyright © 2022 <a href='mailto:aang.drummer@gmail.com'>Abel Güitian</a> | <a href='https://github.com/aang7/aang7.github.io'>Source</a><br>
Last updated on Aug 29, 2025 using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15) <br>
</div>
</footer>
</body>
</html>
